# TAPS
tap "go-task/tap"
tap "aws/tap"
tap "microsoft/git"
tap "tofuutils/tap"
# tap "oven-sh/bun"
tap "pulumi/tap"

# cloud
brew "awscli"
brew "cfn-lint"
brew "cloudformation-guard"
brew "tfenv"
brew "tofuenv"
brew "tflint"
brew "pulumi"

# core
brew "curl"
brew "wget"
brew "git"
brew "direnv"
brew "go-task"
brew "jq"
brew "yq"
brew "zsh"
brew "caddy"
brew "vim"
brew "neovim

## CASKS
# utilities
cask "alt-tab"
cask "scroll-reverser"
cask "raycast"
cask "bartender"
cask "flux"
cask "wireshark"
cask "windows-app"
cask "vnc-viewer"
cask "ghostty"

# browser
cask "firefox"
cask "firefox@developer-edition"
cask "google-chrome"
cask "zen"

# IDE
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "zed"

# media
cask "spotify"
cask "vlc"

# collaboration
cask "drawio"
cask "zoom"
cask "slack"

# other
cask "notion"
cask "kindle"
